Revit 2027 API
DGNExportOptions Methods
The DGNExportOptions type exposes the following members.
Methods
Name | Description
Dispose
(Inherited from BaseExportOptions)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetExportFontTable |  Gets font table.
(Inherited from BaseExportOptions)
GetExportLayerTable |  Gets the layer table.
(Inherited from BaseExportOptions)
GetExportLinetypeTable |  Gets a copy of the line type table.
(Inherited from BaseExportOptions)
GetExportLineweightTable |  Gets a copy of the line weight table.
GetExportPatternTable |  Gets a copy of the pattern table.
(Inherited from BaseExportOptions)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetPredefinedOptions |  Returns an instance DGNExportOptions containing settings from a predefined export setup.
GetPredefinedSetupNames |  Returns a list of names of predefined setups of DGN export options.
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetExportFontTable |  Sets font table to option.
(Inherited from BaseExportOptions)
SetExportLayerTable |  Sets layer table back to option
(Inherited from BaseExportOptions)
SetExportLinetypeTable |  Sets the line type table to use during export.
(Inherited from BaseExportOptions)
SetExportLineweightTable |  Sets the line weight table to use during export.
SetExportPatternTable |  Sets the pattern table to use during export.
(Inherited from BaseExportOptions)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
DGNExportOptions Class
Autodesk.Revit.DB Namespace